"""
Дано предложение и количество раз, сколько его надо повторить. Напишите
программу, которая повторяет данное предложение нужное количество раз.

Формат входных данных
В первой строке подаётся текстовое предложение, во второй – количество
повторений.

Формат выходных данных
Программа должна вывести указанное текстовое предложение нужное количество раз.
Каждое повторение должно начинаться с новой строки.

Тестовые данные

Sample Input 1:
Век живи - век учись.
10

Sample Output 1:
Век живи - век учись.
Век живи - век учись.
Век живи - век учись.
Век живи - век учись.
Век живи - век учись.
Век живи - век учись.
Век живи - век учись.
Век живи - век учись.
Век живи - век учись.
Век живи - век учись.

Sample Input 2:
Время - деньги!
5

Sample Output 2:
Время - деньги!
Время - деньги!
Время - деньги!
Время - деньги!
Время - деньги!
"""

phrase = input()
num = int(input())

for _ in range(num):
    print(phrase)
