"""
На вход программе подаются длина и ширина прямоугольника (вещественные
значения, каждое с новой строки). Необходимо прочитать эти значения и
вычислить периметр прямоугольника (сумму длин сторон). Результат (периметр)
вывести на экран в виде вещественного числа.

Sample Input:
8
11

Sample Output:
38.0
"""

a = float(input())
b = float(input())
print((a + b) * 2)
