"""
Напишите программу вывода переменной math.pi с точностью до тысячных
(три знака после запятой).
"""

from math import pi

print(round(pi, 3))
