"""
На вход программе подается строка. Необходимо прочитать эту строку и
определить число вхождений дефисов (-) в ней. На экране отобразить
полученное число.

Sample Input:
osnovnye-metody-strok

Sample Output:
2
"""

s = input()
print(s.count('-'))
