"""
На вход программе подается строка. Прочитайте эту строку и с помощью метода
String.find найдите в ней индекс первого вхождения фрагмента "ra". Полученное
число (индекс) выведите на экран.

Sample Input:
abrakadabra

Sample Output:
2
"""
s = input()
print(s.find('ra'))
