"""
На вход программе подается слово в виде строки. Необходимо прочитать его и
сформировать новую строку, где введенное слово будет заключено в двойные
кавычки. Результат вывести на экран.

Sample Input:
language

Sample Output:
"language"
"""

print(f'\"{input()}\"')
