"""
В популярном сериале «Остаться в живых» использовалась последовательность
чисел «4 8 15 16 23 42», которая принесла героям удачу и помогла сорвать
джекпот в лотерее. Напишите программу, которая выводит данную
последовательность чисел с одним пробелом между ними.

Формат входных данных
На вход программе ничего не подаётся.

Формат выходных данных
Программа должна вывести текст в соответствии с условием задачи.

Примечание. В чистом виде текст '4 8 15 16 23 42' нельзя использовать. Вместо
этого воспользуйтесь возможностью команды print() выводить несколько
аргументов, указанных через запятую.

Sample Input:

Sample Output:
4 8 15 16 23 42
"""

print(4, 8, 15, 16, 23, 42)
