"""
Напишите программу, которая выводит следующий треугольник, состоящий из
звёздочек (*):
*
**
***
****
*****
******
*******

Формат входных данных
На вход программе ничего не подаётся.

Формат выходных данных
Программа должна вывести текст в соответствии с условием задачи.

Sample Input:

Sample Output:
*
**
***
****
*****
******
*******
"""

print('*')
print('**')
print('***')
print('****')
print('*****')
print('******')
print('*******')
