"""
Напишите программу, которая принимает через стандартный поток ввода
(команда input()) три строки, а затем выводит их в той же последовательности,
каждую на отдельной строке.

Формат входных данных
На вход программе подаются три строки, каждая на отдельной строке.

Формат выходных данных
Программа должна вывести введённые строки в той же последовательности, каждую
на отдельной строке.

Примечание 1. Для считывания текста используйте команду input(), для печати
текста на экране используйте команду print().

Примечание 2. Обратите внимание на то, что ваша программа прогоняется сразу на
нескольких тестах. Поэтому решение должно быть универсальным, то есть оно
должно выводить текст исходя из входных данных, которые поступают вашей
программе на вход.

Тестовые данные

Sample Input 1:
I was
born
this way

Sample Output 1:
I was
born
this way

Sample Input 2:
I love
Python
so much

Sample Output 2:
I love
Python
so much
"""

print(input())
print(input())
print(input())
